Revit 2024 API
MasonryCMUPatternType Enumeration
 The enumerated type representing the permitted values for the asset property "MasonryCMUPattern" from the "MasonryCMU" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum MasonryCMUPatternType
Visual Basic
Public Enumeration MasonryCMUPatternType
Visual C++
public enum class MasonryCMUPatternType
Members
Member name | Description
None
Custom
See Also
Autodesk.Revit.DB.Visual Namespace